#insert_sort.py

"""Сортировка вставками.

1. В начальный момент отсортированная
   последовательность пуста.
2. На каждом шаге алгоритма выбираем один из
   элементов входных данных и помещаем в
   уже отсортированную последовательность
   на нужную позицию до тех пор, пока набор
   входных данных не будет исчерпан.

Пример: [4, 7, 2, 9, 10, 3]
0. [4] [7, 2, 9, 10, 3]
1. [4, 7] [2, 9, 10, 3]
2. [2, 4, 7] [9, 10, 3]
3. [2, 4, 7, 9] [10, 3]
4. [2, 4, 7, 9, 10] [3]
5. [2, 3, 4, 7, 9, 10]

>>> insert_sort([4, 7, 2, 9, 10, 3])
[2, 3, 4, 7, 9, 10]
"""

def insert_sort(arr):
    """Сортировка вставками.
    
    >>> insert_sort([])
    []
    >>> insert_sort([1, 2, 3, 4, 5])
    [1, 2, 3, 4, 5]
    >>> insert_sort([5, 6, 5, 7, 1, 2])
    [1, 2, 5, 5, 6, 7]
    """
    
    for i in range(len(arr)):
        cur = arr[i]
        j = i - 1
        
        while j >= 0:
            if arr[j] > cur:
                arr[j + 1] = arr[j]
                j -= 1
            else:
                break
        if j != i - 1:
            arr[j + 1] = cur
        
    return arr

def main():
    import doctest
    doctest.testmod()
    
if __name__ == "__main__":
    main()
