#select_sort.py
"""Сортировка выбором.

1. Находим минимальный элемент в
   неотсортированной частисписка.
   
2. Производим обмен этого значения со
   значением первой неотсортированной
   позицией в этом списке.
   
3. Теперь сортируем хвост этого списка,
   исключив из рассмотрения уже
   отсортированные элементы.
   
Пример: [2, 7, 1, 8, 2, 6]
1. [] [2, 7, 1, 8, 2, 6]
2. [1] [7, 2, 8, 2, 6]
3. [1, 2] [7, 8, 2, 6]
4. [1, 2, 2] [8, 7, 6]
5. [1, 2, 2, 6] [7, 8]
6. [1, 2, 2, 6, 7] [8]
7. [1, 2, 2, 6, 7, 8]

>>> select_sort([2, 7, 1, 8, 2, 6])
[1, 2, 2, 6, 7, 8]
"""

def select_sort(arr_):
    """Сортировка выбором.
    
    >>> select_sort([])
    []
    >>> select_sort([1, 2, 3, 4, 5])
    [1, 2, 3, 4, 5]
    >>> select_sort([4, 2, 3, 8, 6, 7])
    [2, 3, 4, 6, 7, 8]
    """
    
    arr = arr_.copy()
    n = len(arr)
    for i in range(n):
        i_min = i
        
        for j in range(i + 1, n):
            if arr[i_min] > arr[j]:
                i_min = j
        
        if i_min != i:
            arr[i], arr[i_min] = arr[i_min], arr[i]
    
        
    return arr
    
def main():
    import doctest
    doctest.testmod()
    
if __name__ == "__main__":
    main()
